app/services/local_registry_scanner.rb

SELECT 1 AS one FROM "registries" WHERE "registries"."url" = 'http://localhost:5000' LIMIT 1
INSERT INTO "registries" ("name", "url", "username", "password_digest", "is_default", "is_active", "last_connected_at", "created_at", "updated_at") VALUES ('Local Registry (5000)', 'http://localhost:5000', NULL, NULL, FALSE, TRUE, '2026-02-03 01:24:14.857879', '2026-02-03 01:24:14.864377', '2026-02-03 01:24:14.864377') RETURNING "id"
---
  def scan_and_register!
    discovered = scan

    discovered.each do |registry_info|
      next if Registry.exists?(url: registry_info[:url])

      Registry.create!(
        name: registry_info[:name],
        url: registry_info[:url],
        is_active: true,
        is_default: false,
        last_connected_at: Time.current
      )