app/views/shared/_registry_selector.html.erb

SELECT "registries".* FROM "registries" WHERE "registries"."is_default" = TRUE LIMIT 1
---

      <% Registry.active.order(is_default: :desc, name: :asc).each do |registry| %>

SELECT COUNT(*) FROM "registries"
---

      <% if Registry.count == 0 %>