app/controllers/application_controller.rb

  def current_registry
    return nil if Rails.application.config.use_mock_registry

    if session[:current_registry_id]
      Registry.find_by(id: session[:current_registry_id], is_active: true)
---
SELECT "registries".* FROM "registries" WHERE "registries"."id" = 3 AND "registries"."is_active" = TRUE LIMIT 1