app/controllers/registries_controller.rb

SELECT "registries".* FROM "registries" ORDER BY "registries"."is_default" DESC, "registries"."name" ASC
---
  def index
    @registries = Registry.all.order(is_default: :desc, name: :asc)

INSERT INTO "registries" ("name", "url", "username", "password_digest", "is_default", "is_active", "last_connected_at", "created_at", "updated_at") VALUES ('Test Registry', 'https://test.example.com', '', NULL, FALSE, TRUE, NULL, '2026-02-03 02:29:58.093164', '2026-02-03 02:29:58.093164') RETURNING "id"
---
  def create
    @registry = Registry.new(registry_params)

    if @registry.save

UPDATE "registries" SET "name" = ?, "updated_at" = ? WHERE "registries"."id" = ?  [["name", "Updated Name"], ["updated_at", "2026-02-03 01:18:01.954556"], ["id", 1]]
---
  def update
    if @registry.update(registry_params)

DELETE FROM "registries" WHERE "registries"."id" = 2
---
  def destroy
    if @registry.id == session[:current_registry_id]
      session.delete(:current_registry_id)
    end

    @registry.destroy

UPDATE "registries" SET "last_connected_at" = ?, "updated_at" = ? WHERE "registries"."id" = ?  [["last_connected_at", "2026-02-03 01:18:01.992577"], ["updated_at", "2026-02-03 01:18:01.994180"], ["id", 1]]
---
  def test_connection
    result = RegistryConnectionTester.test(
      @registry.url,
      username: @registry.username,
      password: @registry.password
    )

    if result.success?
      @registry.update(last_connected_at: Time.current)

SELECT "registries".* FROM "registries" WHERE "registries"."id" = 3 LIMIT 1
---
  def set_registry
    @registry = Registry.find(params[:id])