app/models/registry.rb

  def ensure_single_default
    if is_default?
      Registry.where.not(id: id).update_all(is_default: false)
---
UPDATE "registries" SET "is_default" = FALSE WHERE "registries"."id" != 1